# GetHostedInfo Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..GetHostedInfo Method
FabricationPart Class See Also
---
Gets the fabrication hosted element information.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public FabricationHostedInfo GetHostedInfo()
```

Visual Basic
---
```text
Public Function GetHostedInfo As FabricationHostedInfo
```

Visual C++
---
```text
public:
FabricationHostedInfo^ GetHostedInfo()
```

# ### Return Value
The fabrication hosted element information. Returns null if the fabrication part does not have a host.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace